app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "HI this is JOn Snow commenting "], ["post_id", 58], ["created_at", "2020-05-07 00:23:14.688101"], ["updated_at", "2020-05-07 00:23:14.688101"], ["user_id", 1]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = Comment.new comment_params
        @comment.post = @post
        @comment.user = current_user
        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 197]]
---
    def destroy
        @comment = Comment.find params[:id]
       if can?(:crud, @comment)
        @comment.destroy