app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY updated_at DESC
---
    def index
        @posts = Post.all.order('updated_at DESC')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
      def create
        @post = Post.new(params.require(:post).permit(:title, :body))
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
---
      def show
        id = params[:id]
        @post = Post.find(id)
        @comment = Comment.new
    # For the list of answer
    @comments = @post.comments.order(created_at: :desc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
      def edit
        id = params[:id]
        @post = Post.find(id)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3
---
      def update
        id = params[:id]
        @post = Post.find(id)
        if @post.update(params.require(:post).permit(:title, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
      def destroy
        id = params[:id]
        @post = Post.find(id)
        @post.destroy