app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def create
        @user = User.new params.require(:user).permit(:name, :email, :password, :password_confirmation)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$PL8X9jZdOWxKt8nQj0FGauZccuVOzk5K2625YMF.44h.4atqxYfnK"], ["updated_at", "2020-05-07 04:18:26.064001"], ["id", 1]]
---
      def update
        @user = User.find current_user.id
        @user_info= params.require(:user).permit(:name,:email,:old_password, :password ,:password_confirmation)
        if ((@user&.authenticate(@user_info[:old_password])) && (@user_info[:password]!=@user_info[:old_password]))
          if @user.update_attribute(:password, @user_info[:password])